#include<windows.h> // русификаци€
#include<stdlib.h>
#include<stdio.h>

int main() {
	SetConsoleCP(1251);        //русификаци€
	SetConsoleOutputCP(1251); // русификаци€
	
	char planets[][20] = {"меркурий", "венера", "земл€", "марс", "юпитер", "сатурн", "уран", "плутон"};
	
	// определЄнное слово из массива
	//printf("%s", planets[2]);
	//printf("%c", planets[2][0]);
	
	// подсчЄт количества элементов в массиве   char massive[тут должна быть пустота][?] = {}
	size_t pl = sizeof(planets)/sizeof(planets[0]);
	puts("¬сего в массиве: ");
	printf("%i", pl);
	puts(" элементов");
	
	puts("==================================================================");
	
	int i;
	
	for(i=0; i<8; i++) {
		printf("%s\n", planets[i], "\n");
	} 

	puts("==================================================================");
	
	puts("Ёлементов где 2 буква е: ");
	
	for(i=0; i<8; i++) {
		if(planets[i][1] == 'е') {
			printf("%s \n", planets[i]);
		}
		else {
			continue; // пропускает текущий проход
		}
	}
	
	puts("==================================================================");
	// поиск определЄнного символа или слова в массиве или строке -  strstr(где искать, шо искать)
	
	char fruits[][30] = {"€блоко", "лимон", "лайм", "апельсин", "груша", "банан", "мандарин", "киви", "персик", "манго", "ананас", "кокос"};
	
	size_t fr = sizeof(fruits)/sizeof(fruits[0]);
	
	char search_for[10];
	puts("Ўо искать: \n");
	scanf("%s", search_for);
	
	int j;
	
	for(j=0;j<fr;j++) {
		  if(strstr(fruits[j], search_for)) {
		  	printf("%s элемент найден \n");
		  	puts("пор€дковый номер: ");
		  	printf("%i", j);
		  }
		  //else {
		  	//puts("такого элемента нет");
		  //}
	}
	
	return 0;
}
